package Homework01;
/*
  1.  Полностью разобраться с кодом, попробовать переписать с нуля, стараясь не подглядывать.
  2.  Переделать проверку победы, чтобы она не была реализована просто набором условий, например, с использованием циклов. Необходимо учесть, что такая проверка должна быть универсальной для любого размера поля, 1х1, 5х5, 100х100 и так далее.
  3.  * Попробовать переписать логику проверки победы, чтобы она работала для поля 3х3 и 5х5. Очень желательно не делать это просто набором условий для каждой из возможных ситуаций;
  4.  *** Доработать искусственный интеллект, чтобы он мог блокировать ходы игрока.

*/
public class Homework04 {
}
